app/controllers/videos_controller.rb

  def show
    @videos = Video.all
---
SELECT  "videos".* FROM "videos" WHERE (id > 2) ORDER BY "videos"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def create
    @video = Video.new(video_params)

    respond_to do |format|
      if @video.save
---
INSERT INTO "videos" ("wistia", "description", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?, ?)  [["wistia", "pfpWFP"], ["description", "my description "], ["created_at", "2018-01-04 10:22:00.633443"], ["updated_at", "2018-01-04 10:22:00.633443"], ["title", "3RD VIDEO"]]

  def update
    respond_to do |format|
      if @video.update(video_params)
---
UPDATE "videos" SET "wistia" = ?, "title" = ?, "updated_at" = ? WHERE "videos"."id" = ?  [["wistia", "0y0v93sxbq"], ["title", "Title"], ["updated_at", "2018-01-04 11:11:42.107014"], ["id", 2]]